<!--startcut BEGIN header ==============================================-->
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML><HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<TITLE>Bomb &ocirc; Bomb, le premier jeu utilisant l'Addon technology LG #46</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000FF" VLINK="#0000AF"
ALINK="#FF0000">
<!--endcut ============================================================-->

<H4>
"Linux Gazette...<I>making Linux just a little more fun!</I>"
</H4>

<P> <HR> <P> 
<!--===================================================================-->

<A NAME=french></A>
<center>
<H1><font color="maroon">Bomb &ocirc; Bomb, le premier jeu utilisant l'Addon
technology</font></H1>
<H4>By <a href="mailto:david.fauthoux@free.fr">David Fauthoux</a></H4>
<A HREF="#french">Fran&ccedil;ais</A> | <A HREF="#english">English</A>
</center>
<P> <HR> <P>  

<!-- END header -->


<P>Il faudrait peut-&ecirc;tre inventer un nouveau terme, plus complet
que "freeware", pour un nouveau point de vue sur les programmes gratuits.
Si maintenant venait l'id&eacute;e qu'un programme, en plus d'&ecirc;tre
donn&eacute; gratuitement, &eacute;tait donn&eacute; avec la possibilit&eacute;
de le modifier ? Certes, les programmes gratuits sont donn&eacute;s avec
les sources en g&eacute;n&eacute;ral; mais peu de gens, &agrave; moins
d'&ecirc;tre des programmeurs exp&eacute;riment&eacute;s, sont capables
de modifier les programmes qu'ils utilisent. Si maintenant les programmes
"free" &eacute;taient donn&eacute;s avec la possibilit&eacute; de les modifier
facilement et par n'importe qui ?

<P>Depuis peu sur le net, existe un petit aper&ccedil;u de ce point de
vue. <A HREF="http://david.fauthoux.free.fr">http://david.fauthoux.free.fr</A>

<P>Volontairement bas&eacute; sur un jeu ultra-connu (bomberman), ce jeu
peut &ecirc;tre modifi&eacute; &agrave; volont&eacute; en &eacute;crivant
(au plaisir!) dans son fichier d'initialisation.
<BR>Par exemple, on peut rajouter une page de pr&eacute;sentation avec
une image de son choix en rajoutant les lignes
<PRE>[Page]=

background=myPicture.gif</PRE>
Et on peut coller plein d'animations partout simplement en rajoutant des
lignes comme "loop anim="... Et pour plus de simplicit&eacute;, sur le
site on trouve plein de tutorials...

<P>Vous comprenez bien que ce point de vue demande une certaine robustesse
et une large souplesse au moteur du programme. Arr&ecirc;tons-nous un instant
sur cette remarque. En effet, il ne suffit pas de changer quelques lignes
pour faire d'un programme ce que l'on veut. Il fallait donc mettre en oeuvre
une autre fa&ccedil;on de proc&eacute;der. Celle-ci s'adresse aux programmeurs,
mais pas forc&eacute;ment exp&eacute;riment&eacute;s, et m&ecirc;me d&eacute;butants.
Le programme du jeu est fortement structur&eacute; (c++), il permet ainsi
une compr&eacute;hension haut-niveau du fonctionnement (regarder les noms
d'objets et de fonctions suffit, pas besoin de se pencher sur des algorithmes
compliqu&eacute;s). Mais au-del&agrave; de &ccedil;a, cette structuration
permet la mise en oeuvre de l'Addon technology : Gr&acirc;ce &agrave; cette
nouvelle technologie, il est possible de compl&eacute;ter le programme
de fa&ccedil;on ultra-accessible, en &eacute;crivant des "addons", et tous
les addons &eacute;crits &agrave; travers le monde sont et seront compatibles
! Un addon de moins de 20ko peut rajouter une option au jeu : l'addon donn&eacute;
en septembre rajoute une option (avec animations et sons bien entendu !)
qui cr&eacute;e un jeu de poursuite dans le jeu !

<P>Le pouvoir des addons n'est limit&eacute; que par votre imagination.

<HR NOSHADE> <!-- ****************************************************** -->
<A NAME=english></A>

<center>
<H1><font color="maroon">Bomb &ocirc; Bomb, the first game using the Addon technology
</font></H1>
<H4>By <a href="mailto:david.fauthoux@free.fr">David Fauthoux</a></H4>
<EM>English translation by <a href="mailto:jek@ssc.com">Jason Kroll</a></EM><P>
<A HREF="#french">Fran&ccedil;ais</A> | <A HREF="#english">English</A><BR>
</CENTER>

<P><HR><P>

<P> Perhaps it would be necessary to invent a new term, more complete than
"freeware", for a new point of view in free programs. What if now came
the idea that a program, in addition to being given away free, was given with
the possibility of modifying it? Admittedly, free programs are given away
with the sources in general; but few people, unless being experienced
programmers, are able to modify the programs which they use. What if
now the "free" programs were given with the possibility of modifying
them easily and no matter by whom?
  

<P> Recently on the net exists a small outline of this point of view.
<A HREF=http://david.fauthoux.free.fr>http://david.fauthoux.free.fr</A>

<P> Voluntarily based on a ultra-known game (bomberman), Bomb &ocirc; Bomb  can
be modified at will by writing (with pleasure!) in its initialization file. For
example, one can add an interface with an image of his choice by adding the
line

<PRE>[Page]=

background=myPicture.gif</PRE>

And one can stick full with animations everywhere simply by adding lines
like " loop anim ="... And for more simplicity, one finds the site
full of tutorials..

<P> You understand well that this point of view demands a certain
robustness and a broad flexibility with the engine of the program. We stop
one moment on this remark. In effect, it is not enough to change some lines
to make what one wants of a program. It was thus necessary to implement
another way of proceeding. This one is addressed to the programmers, but
not necessarily experienced ones, even beginners. The programming of the game
is strongly structured (c++), thus is allows a high-level understanding
of operation (to look at the names of objects and functions is enough,
there is no need to rely on complicated algorithms). But beyond that, this
structuring allows the implementation of Addon technology: Thanks to
this new technology, it is possible to supplement the program in an
ultra-accessible fashion, in writing addons, and all the addons written
around the world are and will be compatible! An addon of less than 20ko
can add an option to the game: the addon released in September adds an
option (with animations and music of course!) creates a pursuit in the game!

<P> The capacity of addons is limited only by your imagination.






<!-- BEGIN copyright ==================================================-->
<P> <hr> <P> 
<H5 ALIGN=center>

Copyright &copy; 1999, David Fauthoux.  Translation copyright Specialized Systems Consultants, Inc.<BR> 
Published in Issue 46 of <i>Linux Gazette</i>, October 1999</H5>
<!-- END copyright ===================================================-->





<!--startcut footer ===================================================-->
<P> <hr> <P> 
<A HREF="index.html"><IMG ALIGN=BOTTOM SRC="../gx/indexnew.gif" 
ALT="[ TABLE OF CONTENTS ]"></A>
<A HREF="../index.html"><IMG ALIGN=BOTTOM SRC="../gx/homenew.gif"
ALT="[ FRONT PAGE ]"></A>
<A HREF="al-mohssen.html"><IMG SRC="../gx/back2.gif"
ALT=" Back "></A>
<A HREF="../faq/index.html"
	><IMG SRC="./../gx/dennis/faq.gif"
              ALT="[ Linux Gazette FAQ ]"></A>
<A HREF="fink.html"><IMG SRC="../gx/fwd.gif" ALT=" Next "></A>
<P> <hr> <P> 
</BODY></HTML>
<!--endcut ============================================================-->
